Repository: RWS/Sdl-Community
Catalog: SDLTM.Import/SDLTMImportUnitTests/TestingFiles/export.tmx
Source language: cy_gb
Languages: en_gb

source: Y tro cyntaf yn gi o frîd hwn ei arddangos oedd yn 1909, a thair blynedd yn ddiweddarach, mae'r Cairn ei gydnabod gan y Kennel Club, gyda her thystysgrifau ar gael.Aded Text
en_gb: The first time a dog of this breed was exhibited was in 1909, and three years later, the Cairn was recognised by the Kennel Club, with challenge certificates on offer.

source: Eto i gyd, er gwaethaf hyn ymddangosiad cymharol ddiweddar yn ein cylch arddangos, cŵn o'r math Cairn gellir ei olrhain yn ôl rhyw 500 mlynedd, a datblygiad y brîd yn rhedeg yn gyfochrog gyda'r gwaith yn y Skye, West Highland Gwyn a Daeargwn Alban.Aded Text
en_gb: Yet, in spite of this comparatively recent emergence in our show ring, dogs of the Cairn type can be traced back some 500 years, and the breed’s development runs parallel with that of the Skye, West Highland White and Scottish Terriers.

source: Yn wir, pan arddangos gyntaf yn 1909, cafodd ei adnabod fel y Terrier Skye blew cwta.Aded Text
en_gb: In fact, when first exhibited in 1909, it was known as the Shorthaired Skye Terrier.

source: Yr Alban yn yr hynafiaid, mae hyn, daeargi cadarn bach ym mhob ffordd gêm ci bach.Aded Text
en_gb: Scottish in ancestry, this small, sturdy terrier is in every way a game little dog.

source: Mae'n naturiol iawn, gyda ychydig yn shaggy, ond nid yn flêr, ymddangosiad, a'i gôt dal dŵr dwbl yn cymryd ychydig iawn o ymdrech i ofalu amdanynt.Aded Text
en_gb: He is very natural, with a slightly shaggy, but not unkempt, appearance, and his double waterproof coat takes very little effort to look after.

source: Mae ganddo ben arbennig mynegiannol, sy'n cael ei osod i ffwrdd gan tywyll llygaid, disglair sy'n rhoi arwydd da o'i gymeriad.Aded Text
en_gb: He has a particularly expressive head, which is set off by dark, sparkling eyes that give a good indication of his character.

source: Mae wrth ei fodd i bobl, yn nofiwr galluog a heliwr gwych.Aded Text
en_gb: He loves people, is an able swimmer and a great hunter.

source: Mae ganddo glustiau pigo bach a aeliau shaggy a gall ei fynegiant newid o mischievousness i un o ddefosiwn ysgafn yn gyflym iawn.Aded Text
en_gb: He has small prick ears and shaggy eyebrows and his expression can change from mischievousness to one of gentle devotion very quickly.

source: Barod ar gyfer unrhyw weithgaredd, mae'n gwneud yn gydymaith delfrydol i deulu, ffitio i mewn yn dda ag unrhyw ffordd o fyw.Aded Text
en_gb: Ready for any activity, he makes an ideal companion for a family, fitting in well with any lifestyle.

source: Grwp BridAded Text
en_gb: Breed Group

source: Daeargi
en_gb: Terrier

source: Agored i Niwed Breed Brodorol
en_gb: Vulnerable Native Breed

source: Dim
en_gb: No

source: Maint
en_gb: Size

source: Bach
en_gb: Small

source: Faint o ymarfer corff?
en_gb: How much exercise?

source: Hyd at 1 awr y dydd
en_gb: Up to 1 hour per day

source: Hyd y gôt
en_gb: Length of coat

source: Canolig
en_gb: Medium

source: Faint o meithrin perthynas amhriodol?
en_gb: How much grooming?

source: Mwy nag unwaith yr wythnos
en_gb: More than once a week

source: Sôn, siediau?
en_gb: Supposedly sheds?

source: Ydw
en_gb: Yes

source: Mae'r Grŵp Brid Daeargwn
en_gb: The Terrier Breed Group

source: Bydd y rhai sydd wedi darllen Syr Walter Scott yn 'Guy Mannering' yn adnabod yr enw Dandie Dinmont.
en_gb: Those who have read Sir Walter Scott’s 'Guy Mannering' will recognise the name Dandie Dinmont.

source: Mae'r Swydd Stafford yw un o'r rhai mwyaf poblogaidd o'r holl daeargwn.
en_gb: The Staffordshire is one of the most popular of all the terriers.

source: Gyda'r hil ddynol, ei fod yn caredigrwydd ei hun, ac mae ei gariad go iawn o blant yn adnabyddus.
en_gb: With the human race, he is kindness itself, and his genuine love of children is well known.

source: Ei fod yn disgyn o groes rhwng y Bulldog a daeargi, ac felly yn cyfuno anian y ddau bridiau.
en_gb: He is descended from a cross between the Bulldog and a terrier, and thus combines the temperaments of the two breeds.

source: Er gwaethaf ei gysylltiad hanesyddol â ymladd, mae wedi dod yn ffefryn mawr yn y cylch arddangos, ond nid yw hyn wedi cael caniatâd i effeithio ar ei edrych garw traddodiadol.
en_gb: Despite his historical connection with fighting, he has become a great favourite in the show ring, but this has not been allowed to affect his traditional rugged looks.

source: Byr
en_gb: Short

source: Unwaith yr wythnos
en_gb: Once a week

source: Tref neu Thref
en_gb: Town or Country

source: Naill ai
en_gb: Either

source: Math o gartref
en_gb: Type of home

source: Ty Bach neu Fawr
en_gb: Small or Large House

source: Isafswm Maint Gardd
en_gb: Minimum Garden Size

source: Bach / Canolig
en_gb: Small/Medium

source: Hyd Oes
en_gb: Lifespan

source: Dros 10 Mlynedd
en_gb: Over 10 Years

source: * Os ydych yn dioddef o asthma neu os oes gennych alergedd, dylech ymgynghori â'ch ymgynghorydd meddygol cyn ystyried cael ci.
en_gb: * If you are asthmatic or have an allergy, you should consult your medical advisor before considering obtaining a dog.

source: Mae mwy o wybodaeth ar gael ar wefan y Kennel Club.
en_gb: More information can also be found on the Kennel Club website.

source: Cŵn magu yn wreiddiol a'i ddefnyddio ar gyfer hela fermin.
en_gb: Dogs originally bred and used for hunting vermin.

source: 'Terrier' yn dod o'r gair Lladin Terra, sy'n golygu ddaear.
en_gb: 'Terrier' comes from the Latin word Terra, meaning earth.

source: Mae'r casgliad gwydn cŵn yn cael eu magu'n ddetholus i fod yn hynod ddewr ac yn galed, ac i fynd ar drywydd llwynog, y mochyn daear, llygod mawr a'r dyfrgi (i enwi ond rhai) uwchben ac o dan y ddaear.
en_gb: This hardy collection of dogs were selectively bred to be extremely brave and tough, and to pursue fox, badger, rat and otter (to name but a few) above and below ground.

source: Cŵn o'r fath daeargi wedi bod yn hysbys yma ers yr hen amser, ac mor gynnar ag yr Oesoedd Canol, y bridiau gêm yn cael eu portreadu gan awduron ac arlunwyr.
en_gb: Dogs of terrier type have been known here since ancient times, and as early as the Middle Ages, these game breeds were portrayed by writers and painters.

source: Ewch
en_gb: Go

source: Gwybodaeth Iechyd
en_gb: Health Information

source: Cyfyngiadau bridio
en_gb: Breeding Restrictions

source: Bridwyr Sicr
en_gb: Assured Breeders

source: Safon Breed
en_gb: Breed Standard

source: Lliwiau Cofrestru dderbynnir
en_gb: Accepted Registration Colours

source: Lluniau
en_gb: Pictures

source: Watch Brid
en_gb: Breed Watch

source: Pecyn Gwybodaeth
en_gb: Information Pack

source: Dod o hyd i Cŵn Bach
en_gb: Find A Puppy

source: Dod o hyd i A Dog Achub
en_gb: Find A Rescue Dog

source: Dod o hyd Mae Clwb Cŵn
en_gb: Find A Dog Club

source: Mwy
en_gb: More

source: Bridiau eraill
en_gb: Other Breeds

source: Bridiau eraill yn y grŵp hwn
en_gb: Other Breeds in this group

source: Am flynyddoedd lawer, dadlau mawr wedi bodoli yn y rhengoedd y bridwyr daeargi dros fath o daeargi o'r enw 'y Jack Russell'.
en_gb: For many years, great controversy has existed in the ranks of the terrier fanciers over a type of terrier called ‘the Jack Russell’.

source: Daeth y Kennel Club ymwneud â mater hwn o ganlyniad i geisiadau gan nifer sylweddol o devotees o straen Fox Daeargi bridio gan offeiriad hela Fictoraidd, y Parchedig John Russell.
en_gb: The Kennel Club became involved in this affair as a result of applications from a considerable number of devotees of the strain of Fox Terrier bred by a Victorian hunting parson, the Reverend John Russell.

source: Mae'n Tirlyfr waith a dylai cadw'r gallu i gael eu rhychwantu y tu ôl i'r ysgwyddau dwylo maint gyfartaledd.
en_gb: He is a working Terrier and should retain the ability to be spanned behind the shoulders by average sized hands.

source: Gall fod yn llyfn neu garw-gorchuddio, naill ai siaced ei fod yn, anifeiliaid bywiog yn hapus, yr un mor gartrefol wrth weithio neu chwarae gyda'i perchnogion.
en_gb: He can be smooth or rough-coated; in either jacket he is a happy, lively animal, equally at home while working or playing with his owners.

source: Nid yw 'The Parson' yn addas gwirioneddol i fywyd y dref oni chaiff ei roi cryn dipyn o ryddid ac ymarfer corff.
en_gb: ‘The Parson’ is not truly suited to a town life unless given a fair degree of freedom and exercise.

source: Mae'n rhy deallus i gael ei adael ar ei ben ei hun am gyfnodau hir; bydd yn diflasu a gallai yn hawdd fod yn ddinistriol, yn ogystal â gwaethygu y cymdogion gyda'r cyfarth heb ei reoli.
en_gb: He is too intelligent to be left on his own for long periods; he will get bored and could easily become destructive as well as aggravating the neighbours with uncontrolled barking.

source: Rhoddodd y cymeriad dychmygol y brid ei enw.
en_gb: This fictional character gave the breed its name.

source: Mae'r lliwiau a ddefnyddir cŵn hyn yn hysbys, mwstard a phupur, yn cael eu mabwysiadu o enwau cŵn Mannering yn.
en_gb: The colours by which these dogs are known, mustard and pepper, were adopted from the names of Mannering’s dogs.

source: Mae'r Dandie yn edrych yn sidêt ond gall symud yn gyflym iawn.
en_gb: The Dandie looks sedate but can move very quickly.

source: Mae'n dyn deallus gydag ewyllys ei hun nad y mwyaf ufudd o anifeiliaid anwes.
en_gb: He is an intelligent chap with a will of his own not the most obedient of pets.

source: Neilltuo i blant, gall doddi'r anoddaf calonnau gyda'i mynegiant soulful ac yn mwynhau, ac yn gofyn am, digon o sylw.
en_gb: Devoted to children, he can melt the hardest of hearts with his soulful expression and enjoys, and asks for, plenty of attention.

source: Mae'r brîd yn dod o'r un stoc gwraidd â llawer o bobl eraill o'r gogledd Lloegr a'r gororau rhwng Lloegr a'r Alban.
en_gb: The breed comes from the same root stock as many others from the north of England and the borders between England and Scotland.

source: Roedd y Dandie ddatblygu yn y 1600au ar gyfer moch daear a dyfrgwn hela.
en_gb: The Dandie was developed in the 1600s for badger and otter hunting.

source: Daeargwn Cairn
en_gb: Cairn Terrier

source: Daeargwn Cairn oedd un o'r bridiau gwreiddiol yr Alban, sy'n tarddu yn yr Ucheldiroedd ac Ynysoedd West Coast.
en_gb: Cairn Terriers were one of the original breeds of Scotland, originating in the Highlands and the West Coast Islands.

source: Mae'r Cairn wedi cael ei fagu ers cyn cof am ei allu i fynd i'r ddaear ac adennill ei ffordd drwy bentyrrau o greigiau (garneddau) i gyrraedd y cuddio fermin yn y meysydd hyn.
en_gb: The Cairn has been bred since time immemorial for its ability to go to earth and claw its way through piles of rocks (cairns) to get to the vermin hiding in these areas.

source: A elwid gynt yn y Terrier Skye clustiog blew cwta neu Priciwch, a galwyd ef y Tirlyfr Cairn yn 1910.
en_gb: Previously known as the Shorthaired or Prick Eared Skye Terrier, it was named the Cairn Terrier in 1910.

source: Ofynion gofal
en_gb: Care requirements

source: Personoliaeth Breed, nodweddion ac anian
en_gb: Breed personality, characteristics & temperament

source: Nid yw'r Cairn wedi cael y teitl 'y pal bach gorau yn y byd' am ddim.
en_gb: The Cairn has not been given the title of ‘the best little pal in the world’ for nothing.

source: Mae'r sefyllfa mae'n ei dal yng nghalonnau a meddyliau pobl sydd wedi bod yn berchen un neu fwy ohonynt yn enwog.
en_gb: The position it holds in the hearts and minds of people who have owned one or more of them is renowned.

source: Mae'r rhain yn cŵn yn ffyddlon, cariadus, chwilfrydig a deallus, ond eto gyda ddisgleirdeb ddireidus yn y llygad sy'n eu gwneud mor ddeniadol iawn.
en_gb: These dogs are loyal, loving, inquisitive and intelligent, yet with a mischievous sparkle in the eye that makes them so very appealing.

source: Gyda Daeargi Cairn, cymeriad a phersonoliaeth yn mynd gyda'i gilydd.
en_gb: With a Cairn Terrier, character and personality go together.

source: Does dim byd gwell na bod yn eistedd yn darllen llyfr, gwylio teledu neu dim ond ymlacio ar y soffa ac yn cael trwyn gwlyb neu paw cyfeillgar gwthio i mewn i eich llaw.
en_gb: There is nothing better than to be sitting reading a book, watching television or just relaxing on the couch and having a wet nose or friendly paw pushed into your hand.

source: Mae bod yn gi y mae'n gweithio mewn cydweithrediad agos â chŵn eraill nad Daeargwn Cairn ddim yn edrych am drwbl, ond bydd yn amddiffyn eu tiriogaeth a theulu gyda dewrder mawr a defosiwn yn ôl yr angen i wneud hynny.
en_gb: Being a dog that has to work in close co-operation with other dogs Cairn Terriers do not look for trouble, but will defend their territory and family with great courage and devotion when required to do so.

source: Cysondeb gyda anifeiliaid anwes eraill
en_gb: Compatibility with other pets

source: Carneddau yn hyblyg iawn.
en_gb: Cairns are very adaptable.

source: Wrth gyflwyno pup newydd i anifeiliaid anwes eraill, byth yn gwneud mwy o stŵr o un na'r llall.
en_gb: When introducing a new pup to other pets, never make more of a fuss of one than the other.

source: Peidiwch â cheisio gorfodi cyflymder ac yn disgwyl anifeiliaid anwes i ddod yn 'ffrindiau' o fewn y pum munud cyntaf.
en_gb: Don't try to force the pace and expect pets to become ‘mates’ within the first five minutes.

source: Mae Cairn yn gi gorchuddio-dwbl.
en_gb: A Cairn is a double-coated dog.

source: Mae'n ddoeth bod y topcoat yn cael ei dynnu allan ar ddechrau'r haf.
en_gb: It is advisable that the topcoat is stripped out at the onset of summer.

source: Gallai bridiwr eich ci eich helpu gyda hyn neu o leiaf argymell rhywun i wneud hynny ar eich rhan.
en_gb: The breeder of your dog could help you with this or at least recommend someone to do it for you.

source: Fel perchennog cyfrifol, mae angen i chi wneud yn siwr bod yr holl ffensys o uchder addas.
en_gb: As a responsible owner, you need to make sure all fences are of a suitable height.

source: Cofiwch mai'r rhan wannaf o unrhyw ffens yw'r porth, y gellir fel arfer yn cael ei agor yn rhwydd ac yn cael ei adael yn aml yn y ffordd honno.
en_gb: Remember that the weakest part of any fence is the gate, which can usually be easily opened and is often left that way.

source: Rhowch rai teganau ysgogol i helpu i leddfu diflastod eich ci.
en_gb: Give your dog some stimulating toys to help alleviate boredom.

source: Mae ymarfer corff yn y rhan fwyaf o bwysig gan ei fod yn cadw eich trim Cairn ac yn adeiladu cyhyrau da.
en_gb: Exercise is most important as it keeps your Cairn trim and builds good muscle tone.

source: Trwy fynd â'ch Terrier Cairn am dro, nid yn unig y gallwch chi gael eich ymarfer corff hefyd, ond mae'n ffordd wych o rannu amser o ansawdd gyda'ch anifail anwes.
en_gb: By taking your Cairn Terrier for a walk, not only can you get your exercise as well, but it is a wonderful way of sharing quality time with your pet.

source: Enghreifftiau llai o'r Daeargi Bull wedi bod yn hysbys ers dechrau'r bedwaredd ganrif ar bymtheg, ond maent yn syrthio allan o blaid cyn y Rhyfel Byd Cyntaf ac yn cael eu tynnu oddi ar y Brid Kennel Club Gofrestr yn 1918.
en_gb: Smaller examples of the Bull Terrier have been known since the early nineteenth century but they fell out of favour prior to the First World War and were removed from the Kennel Club Breed Register in 1918.

source: Yn 1938, adfywiad ei arwain gan y Cyrnol Richard Glyn a grŵp o gyd-frwdfrydig, a ffurfiodd y Miniature Clwb Bull Terrier.
en_gb: In 1938, a revival was spearheaded by Colonel Richard Glyn and a group of fellow enthusiasts, who formed the Miniature Bull Terrier Club.

source: Y safon yn yr un fath ag o'r Bull Terrier ac eithrio eu maint, ni ddylai fod yn fwy na 35.5 cm (14 modfedd).
en_gb: The standard is the same as that of the Bull Terrier with the exception of their size, which should not exceed 35.5 centimetres (14 inches).

source: Disgrifiad
en_gb: Description
